---
kind: method
id: M:Autodesk.Revit.DB.ImportIFCOptions.GetImportIFCOptions
source: html/c3ed9909-c040-895f-2eee-dbcdb8cb5716.htm
---
# Autodesk.Revit.DB.ImportIFCOptions.GetImportIFCOptions Method

Returns the current Revit instance's ImportIFCOptions.

## Syntax (C#)
```csharp
public static ImportIFCOptions GetImportIFCOptions()
```

## Returns
The ImportIFCOptions for the current Revit instance.